package consolegame;
import java.util.Scanner;
public class 무기 extends 아이템{
	double 공격력;
	int 소유여부;
	
	무기(){}
	무기(String 이름, int 가격, double 공격력, int 소유여부){
		this.이름=이름;
		this.가격=가격;
		this.공격력=공격력;
		this.소유여부=소유여부;
	}
	
//-------무기 보유현황 보여주는 메소드--------------	
	public String 보유무기(int 소유여부) {
		if(소유여부==1) {
			return "O";
		}else {
			return "X";
		}
	}
//----------무기 인벤토리 정보-------------------
	public static void 정보(무기 낡은검,무기 강철검, 무기 무의검, 무기 자하드의검, 무기 하급검, 무기 중급검, 무기 상급검) {
		for(int i=0; i<60; i++) {
			System.out.println("");
		}
		System.out.println("==========================================================================");
		System.out.println("1. "+낡은검.이름+"(공격력 "+(int)낡은검.공격력+"+)---------------------------------------------보유여부:"+낡은검.보유무기(낡은검.소유여부));
		System.out.println("2. "+강철검.이름+"(공격력 "+(int)강철검.공격력+"+)---------------------------------------------보유여부:"+강철검.보유무기(강철검.소유여부));
		System.out.println("3. "+무의검.이름+"(공격력 "+(int)무의검.공격력+"+)---------------------------------------------보유여부:"+무의검.보유무기(무의검.소유여부));
		System.out.println("4. "+자하드의검.이름+"(공격력 "+(int)자하드의검.공격력+"+)------------------------------------------보유여부:"+자하드의검.보유무기(자하드의검.소유여부));
		System.out.println("5. "+하급검.이름+"(공격력 "+(int)하급검.공격력+"+)---------------------------------------------보유여부:"+하급검.보유무기(하급검.소유여부));
		System.out.println("6. "+중급검.이름+"(공격력 "+(int)중급검.공격력+"+)---------------------------------------------보유여부:"+중급검.보유무기(중급검.소유여부));
		System.out.println("7. "+상급검.이름+"(공격력 "+(int)상급검.공격력+"+)---------------------------------------------보유여부:"+상급검.보유무기(상급검.소유여부));
		System.out.println("==========================================================================");
	}
}
