package consolegame;

public class 방어구 extends 아이템{
	double 방어력;
	int 소유여부;

	방어구(){}
	방어구(String 이름, int 가격, double 방어력, int 소유여부){
		this.이름=이름;
		this.가격=가격;
		this.방어력=방어력;
		this.소유여부=소유여부;
	}
	
//---------방어구 보유 현황 보여주는 메소드------------	
	public String 보유방어구(int 소유여부) {
		if(소유여부==1) {
			return "O";
		}else {
			return "X";
		}
	}
	
//---------방어구 인벤토리 정보 메소드---------------
	public static void 정보(방어구 낡은갑옷, 방어구 강철갑옷, 방어구 무의갑옷, 방어구 자하드의갑옷, 방어구 하급갑옷, 방어구 중급갑옷, 방어구 상급갑옷) {
		for(int i=0; i<60; i++) {
			System.out.println("");
		}
		System.out.println("===========================================================");
		System.out.println("1. "+낡은갑옷.이름+"(방어력 "+(int)낡은갑옷.방어력+"+)--------------------------------보유여부:"+낡은갑옷.보유방어구(낡은갑옷.소유여부));
		System.out.println("2. "+강철갑옷.이름+"(방어력 "+(int)강철갑옷.방어력+"+)--------------------------------보유여부:"+강철갑옷.보유방어구(강철갑옷.소유여부));
		System.out.println("3. "+무의갑옷.이름+"(방어력 "+(int)무의갑옷.방어력+"+)--------------------------------보유여부:"+무의갑옷.보유방어구(무의갑옷.소유여부));
		System.out.println("4. "+자하드의갑옷.이름+"(방어력 "+(int)자하드의갑옷.방어력+"+)-----------------------------보유여부:"+자하드의갑옷.보유방어구(자하드의갑옷.소유여부));									
		System.out.println("5. "+하급갑옷.이름+"(방어력 "+(int)하급갑옷.방어력+"+)--------------------------------보유여부:"+하급갑옷.보유방어구(하급갑옷.소유여부));
		System.out.println("6. "+중급갑옷.이름+"(방어력 "+(int)중급갑옷.방어력+"+)--------------------------------보유여부:"+중급갑옷.보유방어구(중급갑옷.소유여부));
		System.out.println("7. "+상급갑옷.이름+"(방어력 "+(int)상급갑옷.방어력+"+)--------------------------------보유여부:"+상급갑옷.보유방어구(상급갑옷.소유여부));
		System.out.println("===========================================================");
	}
}
